app/controllers/api/v1/timecards_controller.rb

SELECT "timecards".* FROM "timecards" WHERE "timecards"."user_id" = $1 ORDER BY "timecards"."created_at" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 50]]
---
      def index
        timecards = Timecard.where(user_id: params[:user_id]).order(created_at: :DESC).limit(50)

INSERT INTO "timecards" ("user_id", "time_in", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["time_in", "2023-03-15 08:12:08.710813"], ["created_at", "2023-03-15 08:12:08.712020"], ["updated_at", "2023-03-15 08:12:08.712020"]]
---
      def time_in
        timecard = Timecard.new
        timecard.time_in = Time.now
        timecard.user_id = params[:user_id]

        if timecard.save

INSERT INTO "timecards" ("user_id", "time_out", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["time_out", "2023-03-15 08:12:08.731509"], ["created_at", "2023-03-15 08:12:08.732327"], ["updated_at", "2023-03-15 08:12:08.732327"]]
---
      def time_out
        timecard = Timecard.new
        timecard.time_out = Time.now
        timecard.user_id = params[:user_id]

        if timecard.save