app/controllers/api/v1/timecards_controller.rb

SELECT "timecards".* FROM "timecards" WHERE "timecards"."user_id" IS NULL ORDER BY "created_at" DESC LIMIT ?  [["LIMIT", 50]]
---
      def index
        timecards = Timecard.where(user_id: params[:user_id]).order(created_at: :DESC).limit(50)

INSERT INTO "timecards" ("user_id", "time_in") VALUES (?, ?)  [["user_id", 1], ["time_in", "2023-03-14 18:22:55.568282"]]
---
      def time_in
        timecard = Timecard.new
        timecard.time_in = Time.now
        timecard.user_id = params[:user_id]

        if timecard.save

INSERT INTO "timecards" ("user_id", "time_out") VALUES (?, ?)  [["user_id", 1], ["time_out", "2023-03-14 18:23:08.248229"]]
---
      def time_out
        timecard = Timecard.new
        timecard.time_out = Time.now
        timecard.user_id = params[:user_id]

        if timecard.save