app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name") VALUES (?)  [["name", "test"]]
---
      def create
        user = User.new
        user.name = params[:name]

        if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "user_follows".* FROM "user_follows" WHERE "user_follows"."follower_id" = ? ORDER BY "user_follows"."id" ASC LIMIT ?  [["follower_id", 1], ["LIMIT", 1]]
INSERT INTO "user_follows" ("follower_id", "user_id") VALUES (?, ?)  [["follower_id", 1], ["user_id", 2]]
---
      def follow
        user = User.find(params[:user_id])
        follower = User.find(params[:follower_id])
        if user && follower
          follower.user_follows.first_or_initialize.tap do |user_follow|
            user_follow.user_id = user.id
            user_follow.save!

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "user_follows" WHERE "user_follows"."id" = ?  [["id", 1]]
SELECT "user_follows".* FROM "user_follows" WHERE "user_follows"."follower_id" = ? AND "user_follows"."user_id" = ?  [["follower_id", 1], ["user_id", 2]]
---
      def unfollow
        user = User.find(params[:user_id])
        follower = User.find(params[:follower_id])
        if user && follower
          follower.user_follows.where(user_id: user.id).destroy_all