app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Tempore dolorum quidem esse."], ["created_at", "2023-03-15 08:12:08.749559"], ["updated_at", "2023-03-15 08:12:08.749559"]]
---
      def create
        user = User.new
        user.name = params[:name]

        if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "user_follows".* FROM "user_follows" WHERE "user_follows"."follower_id" = ? ORDER BY "user_follows"."id" ASC LIMIT ?  [["follower_id", 2], ["LIMIT", 1]]
INSERT INTO "user_follows" ("follower_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 14], ["user_id", 13], ["created_at", "2023-03-15 08:12:08.777221"], ["updated_at", "2023-03-15 08:12:08.777221"]]
---
      def follow
        user = User.find(params[:user_id])
        follower = User.find(params[:follower_id])
        if user && follower
          follower.user_follows.first_or_initialize.tap do |user_follow|
            user_follow.user_id = user.id
            user_follow.save!

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "user_follows" WHERE "user_follows"."id" = ?  [["id", 1]]
SELECT "user_follows".* FROM "user_follows" WHERE "user_follows"."follower_id" = ? AND "user_follows"."user_id" = ?  [["follower_id", 2], ["user_id", 1]]
---
      def unfollow
        user = User.find(params[:user_id])
        follower = User.find(params[:follower_id])
        if user && follower
          follower.user_follows.where(user_id: user.id).destroy_all